#define _CRT_SECURE_NO_DEPRECATE
#define _USE_MATH_DEFINES
#include <stdio.h>
#include <locale.h>
#include <math.h>

int main() {
	setlocale(LC_CTYPE, "RUS");

	double x, y;
	double S, S1, S2, S3;
	const int Ax = 2, Ay = 5, Bx = 5, By = 1, Cx = 2, Cy = -4; //координаты точек вершин треугольника
	
	printf("Введите координату х: ");
	scanf("%lf", &x);
	printf("Введите координату у: ");
	scanf("%lf", &y);

	//вершина P это точка с координатами (x, y)
	S = (1.0 / 2) * abs(((Bx - Ax) * (Cy - Ay) - (Cx - Ax) * (By - Ay))); //площадь основного треугольника
	S1 = (1.0 / 2) * abs(((Ax - x) * (By - y) - (Bx - x) * (Ay - y))); //площадь треугольника с вершинами PAB
	S2 = (1.0 / 2) * abs(((Bx - x) * (Cy - y) - (Cx - x) * (By - y))); //площадь треугольника с вершинами PBC
	S3 = (1.0 / 2) * abs(((Cx - x) * (Ay - y) - (Ax - x) * (Cy - y))); //площадь треугольника с вершинами PCA

	//контрольный пример:
	// s = 1/2*|(5 - 2)*(-4 - 5)-(2 - 2)*(1 - 5)|= 13,5
	//s1 = 1/2*|(2 - 3)*(1 - 2)-(5 - 3)*(5 - 2)|= 2,5
	//s2 = 1/2*|(5 - 3)*(-4 - 2 )-(2 - 3)*(1 - 2)|=6,5
	//s3 = 1/2*|(2 - 3)*(5 - 2) - (5 - 3)*(-4 - 2)|= 4.5
	//проверка: 6,5 + 4,5 + 2,5 = 13,5 = 13,5
	
	if (S1 + S2 + S3 == S) { //проверка условия
		printf("\nТочка с координатами x = %.1f и y = %.1f принадлежит к данной заштрихованной области.\n", x, y);
	}
	else {
		printf("\nТочка с координатами x = %.1f и y = %.1f не принадлежит к данной заштрихованной области.\n", x, y);

	}
}