# Homework-6
## Условие задачи 1
Написать программу, которая вычисляет время в минутах до полудня или полуночи в зависимости от того, что ближе к введенному пользователем времени в часах(0-24) и в минутах(0 - 60).
### Алгоритм
1. Задаём константы:
   h1 = 12 - полудень
   h2 = 24 - полночь
   m = 60 - минуты
2. Задаём исходные данные:
   hours - часы, вводимые пользователем
   minutes - минуты, вводимые полтзователем
3. Объявляем условный оператор.
Проверить условие:
- Если h1−hours > 0 (текущий час меньше 12), то вычислить и вывести время до полудня:
  - часы до полудня = h1 − hours
  - минуты до полудня = m − minutes
- Иначе (если часы 12 или больше) вычислить и вывести время до полуночи:
  - часы до полуночи = h2 − hours
  - минуты до полуночи = m − minutes
4.  Вывести результат
### Блок-схема
### Результат
	printf("Время до полудня составляет %d час и %d минут", h1 - hours, m - minutes);
	printf("Время до полуночи составляет %d час и %d минут", h2 - hours, m - minutes);

## Условие задачи 2
Составить программу, которая проверяет принадлежит ли заданная пользователем точка с координатами (х, у) заданным закрашенным (заштрихованным) областям, показанным на рисунке 21, и выводит на экран сообщение.
### Алгоритм
1. Объявить константы:
  Ax = 2 , Ay = 5 - Координаты вершины A
  Bx = 5, By = 1 - Координаты вершины B
  Cx = 2, Cy = -4 - Координаты вершины C
2. Задаем исходные данные:
   x - вводимая пользователем координата x
   y - вводимая пользователем координата y
   S - площадь треугольника с вершинами ABC
   S1 - площадь треугольника с вершинами PAB
   S2 - площадь треугольника с вершинами PBC
   S3 - площадь треугольника с вершинами PAC
3. Рассчитаем площади треугольников:
   S = (1.0 / 2) * abs(((Bx - Ax) * (Cy - Ay) - (Cx - Ax) * (By - Ay))); //площадь основного треугольника
  S1 = (1.0 / 2) * abs(((Ax - x) * (By - y) - (Bx - x) * (Ay - y))); //площадь треугольника с вершинами PAB
  S2 = (1.0 / 2) * abs(((Bx - x) * (Cy - y) - (Cx - x) * (By - y))); //площадь треугольника с вершинами PBC
  S3 = (1.0 / 2) * abs(((Cx - x) * (Ay - y) - (Ax - x) * (Cy - y))); //площадь треугольника с вершинами PCA
4. Проверка условия:
   Если S1 + S2 + S3 = S, то
     printf("\nТочка с координатами x = %.1f и y = %.1f принадлежит к данной заштрихованной области.\n", x, y)
   Иначе
     printf("\nТочка с координатами x = %.1f и y = %.1f не принадлежит к данной заштрихованной области.\n", x, y)
### Блок-схема
### Результат
  Если S1 + S2 + S3 = S — точка находится внутри или на границе треугольника.
  Иначе — точка вне треугольника.
### Информация о разработчике:
Пономарева Валерия Тимуровна бИЦ-251
